# utils/stopwords_mn.py

# Mongolian stopwords
MN_STOPWORDS = {
    "ба", "бол", "байх", "байна", "буюу", "эгээ", "гэх", "гэдэг", "гэж", "энэ", "тэр",
    "тэгээд", "харин", "гэвч", "мөн", "түүнчлэн", "үүд", "аа", "ээ",
    "би", "чи", "та", "тэд", "манай", "таны", "өө", "ямар", "маш"
}

STOPWORD_PHRASES = {"ямар нэгэн"}

MN_SUFFIXES = [
    "аас","ээс","оос","өөс",
    "аар","ээр","оор","өөр",
    "тай","тэй","той",
    "руу","рүү",
    "даа","дээ","доо","дээ","дөө",
    "ын","ийн","ны","ний",
    "нууд","нүүд",
    "ууд","үүд",
    "ыг","ийг",
]
MN_SUFFIXES = sorted(set(MN_SUFFIXES), key=len, reverse=True)
